[
  {
    "title": "OceanGate Titan Submarine Incident (June 2023)",
    "description": "A crewed submersible vessel designed by OceanGate to carry researchers and tourists to the Titanic wreck (~3,800 m depth). The onboard software controls navigation, life‑support, pressure monitoring, and emergency systems.",
    "objectives": "Safety and Fault Tolerance — software must detect anomalies in hull pressure, structural integrity, life‑support, and safely handle failures.\r\n\r\nReliability under high pressure — system must maintain operation and accuracy under extreme depth and pressure.\r\n\r\nReal‑time Monitoring and Alerting — immediate detection of out‑of‑range sensor data and automated emergency responses.",
    "roles": "Developer",
    "standards": "Other",
    "test_plan": "Unit tests on sensor-read modules: verify zero, out-of-range, and corrupted inputs.\r\n\r\nIntegration tests: entire life‑support and navigation software on hardware-in-the-loop or high‑fidelity simulators.\r\n\r\nFault‑injection tests: simulate communications dropouts, erroneous sensor outputs, power loss, memory corruption.\r\n\r\nStress/duration tests: simulate continuous 48+ hour deep-sea mission.\r\n\r\nEmergency procedure tests: verify automated response on pressure spike, critical oxygen drop, or structural compromise.",
    "defect_management": "All identified defects logged in a centralized tracking system (e.g., JIRA) with severity classifications.\r\n\r\nHigh-severity issues (safety-critical) must have patches or mitigations before any launch.\r\n\r\nRoot-cause analysis required for any failure in test; findings must be approved by Software Safety Engineer.",
    "reviews": "Peer code reviews are mandatory for all safety-critical modules.\r\n\r\nSafety audits per IEC 61508 by an independent safety assessor before deployment.\r\n\r\nDesign reviews with cross-functional teams (software, mechanical, systems, QA) at completion of major risk zones (e.g., 10k LOC, new feature modules).",
    "supplier_control": "External sensor/hardware suppliers must provide documentation, interface specifications, and evidence of testing at full-depth conditions.\r\n\r\nSoftware libraries and third-party components must have signed SBOMs and documented licenses.\r\n\r\nAll supplier deliverables undergo integration tests before acceptance.",
    "references": "Taub, B. (2023, July 1). The Titan submersible was “an accident waiting to happen”. The New Yorker. https://www.newyorker.com/news/a-reporter-at-large/the-titan-submersible-was-an-accident-waiting-to-happen\r\n\r\nHarris, M. (2024, June 11). The Titan submersible disaster shocked the world. The exclusive inside story is more disturbing than anyone imagined. Wired. https://www.wired.com/story/titan-submersible-disaster-inside-story-oceangate-files/\r\n\r\nPozirekides, T. (2025, June 11). Two years after Titan imploded, here’s the latest on the OceanGate investigation. Netflix Tudum. https://www.netflix.com/tudum/articles/titan-the-oceangate-disaster-case-stockton-rush",
    "purpose": "To ensure the Titan submersible’s software is reliable, safe under extreme conditions, and capable of detecting or mitigating failures, preventing a catastrophic incident like hull breach or life‑support failure."
  }
]